# a = 0
# b = 222222222
# c = -2
#
# a1 = 4.4
# b1 = 4.22222222
# c1 = -4323213.2131234

# a = 2 + 3
# print(a)

# a = 2 + 3.5
# print(type(a))
# print(a)

"float - вещественное число - 3.5, 7.234"
"int - целочисленное значение - 2, 3, 4"

# a = 8 / 2
# b = 3 / 6
# print(type(a))
# print(a)
# print(b)

# a = 7 // 2
# print(a)
# b = 91 // 2
# print(b)
# c = -7 // 2
# print(c)

# a = 4.5 * 2
# b = 4 * 2
# print(a)
# print(b)

# a = 10 % 3
# print(a)
# "получаем остаток от деления на самое подходящее для деления число т.е. 9"
# b = 123 % 10
# print(b)

# print(9 % 5) # 9 - 5 = 4
# print(-9 % 5) # наименьшее число которое делится нацело -10, и дальше -9 - (-10) = 1
# print(9 % -5) # берем наибольшее 10, а значит 9 - 10 = -1
# print(-9 % -5) # -9 - (-5) = -4

# # возведение в степень
# a = 2 ** 3 # 2 * 2 * 2
# print(a)

# b = 2 + 4 * 7
# print(b)

# a = 1
# a = a + 1
# print(a)

# a = 1
# a += 1 # то же самое, что и a = a + 1
# print(a)
#
# a = 1
# a /= 10
# print(a)

