# s1 = "Ярослав"
# s2 = 'Прахов'
# s3 = """
# Прахов
# Ярослав
# Вадимович
# """
# print(s3)
# s4 = """
# Ярослав /n Вадимович
# """
# # !!! /n - new line, часто используется в работе !!!
#
# s5 = " "
# print(s5)
# конкотинация
# s4 = s1 + " " + s2
# print(s4)
# a = 4
# s5 = s1 + " " + s2 + str(a)
# print(s5)
# s6 = s1 * 3
# print(s6)
# s7 = (s1 + " ") * 3
# print(s7)
#
# s8 = len(s1)
# print(s8)
#
# b = " "
# s9 = len(b)
# print(s9)

# буллевые значения - Тру или фолс
# print(s1 in s3)
#
# print(s2 in s6)
#
# print("слав" in s1)

# проверка идентичности значений
# print("Ярослав" == s1)
#
# print("Ярослав" == s3)
#
# # сравнение строк по азбуке
# c = "абвг"
# d = "авг"
# print(c > d)

# c = "аб"
# d = "ав"
# print(c > d)
# # у каждого элемента будь то буква или пробел есть определенный номер
# print(ord("а"))
# print(ord("б"))
# print(ord("в"))
# print(c < d)

e = "2312"
print(type(e))
print(type(int(e)))
